
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	СоздаваемыеРеквизитыФормы = Новый Соответствие;
	
	СоздаваемыеРеквизитыФормы.Вставить("ВКМ_Период_Действия_Договора", Новый КвалификаторыДаты(ЧастиДаты.Дата));
	СоздаваемыеРеквизитыФормы.Вставить("ВКМ_Суммы_Абонентской_Платы", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный));
	СоздаваемыеРеквизитыФормы.Вставить("ВКМ_Стоимость_Часа_Работы", Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Неотрицательный));
	
	ЭлементыФормы = ЭтотОбъект.Элементы;
	МетаданныеФормы = ЭлементыФормы.Метаданные();
	ГруппаРеквизитов = ЭлементыФормы.Группы.Добавить("ВКМ_ГруппаДобовляемыхРеквизитов");
		
	ДобавлянмыеРеквизиты = Новый Массив;
  
    Для Каждого Запись Из  СоздаваемыеРеквизитыФормы Цикл
    	
        ИмяРеквизита = Запись.Ключ;
	    НаименованиеРеквизита = Сред(ИмяРеквизита, 5,25);
	    НаименованиеРеквизитаМассив = СтрРазделить(НаименованиеРеквизита,"_" );
	    НаименованиеРеквизита = НаименованиеРеквизитаМассив[0] + " " + НРег(НаименованиеРеквизитаМассив[1]) + " " + НРег(НаименованиеРеквизитаМассив[2]);
	    Квалификатор = Запись.Значение;
    	
    	НовыйРеквизит = ГруппаРеквизитов.Реквизиты.Добавить(ИмяРеквизита, Квалификатор);	    	    
	    //НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизита, ИмяРеквизита, ИмяРеквизита, Истина, Квалификатор); 
	    //НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизита,Квалификатор,,НаименованиеРеквизита, Истина);
	 	ДобавлянмыеРеквизиты.Добавить(НовыйРеквизит);
		
		ОписаниеСвойства = ВКМ_ПереченьСвойств.Добавить();
		ОписаниеСвойства.ИмяРеквизита = ИмяРеквизита;
		ОписаниеСвойства.Видимость = Ложь;
		
    КонецЦикла;
    	
	ИзменитьРеквизиты(ДобавлянмыеРеквизиты);
	
	Форма = ЭтаФорма;
	
	//ГруппаНаформе = Форма.Добавить(Тип("Группа"), "ВКМ_ГруппаДобовляемыхРеквизитов");
	
	Для Каждого ОписаниеСвойства Из ВКМ_ПереченьСвойств Цикл 
		
		Если Не ОписаниеСвойства.Видимость Тогда
			Продолжить;
		КонецЕсли;
		
		Элемент = Элементы.Добавить(ОписаниеСвойства.ИмяРеквизита, Тип("ПолеФормы"), ГруппаРеквизитов);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = ОписаниеСвойства.ИмяРеквизита;		
		
	КонецЦикла;
	
	Если Не Параметры.Ключ.Пустая() Тогда
		ПрочитатьЗначенияСвойств();
	КонецЕсли;
	

КонецПроцедуры


&НаСервере
Процедура ПрочитатьЗначенияСвойств()	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_АбонентскаяРаботаСрезПоследних.Объект,
	|	ВКМ_АбонентскаяРаботаСрезПоследних.ИмяРеквизита,
	|	ВКМ_АбонентскаяРаботаСрезПоследних.Значение
	|ИЗ
	|	РегистрСведений.ВКМ_АбонентскаяРабота.СрезПоследних КАК ВКМ_АбонентскаяРаботаСрезПоследних
	|ГДЕ
	|	ВКМ_АбонентскаяРаботаСрезПоследних.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ЗначениеСвойств = Новый Структура;
	
	Пока Выборка.Следующий() Цикл		
		ЗначениеСвойств.Вставить(Выборка.ИмяРеквизита, Выборка.Значение); 		
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,ЗначениеСвойств);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	 НаборЗаписей = РегистрыСведений.ВКМ_АбонентскаяРабота.СоздатьНаборЗаписей();
	 НаборЗаписей.Отбор.Объект.Установить(ТекущийОбъект.Ссылка);
	
	 Для Каждого ОписанияСвойства Из ВКМ_ПереченьСвойств Цикл 
		 
		 Запись = НаборЗаписей.Добавить();
		 Запись.Объект = ТекущийОбъект.Ссылка;
		 Запись.ИмяРеквизита = ОписанияСвойства.ИмяРеквизита;
		 Запись.Значение = ЭтотОбъект[ОписанияСвойства.ИмяРеквизита];
		 
	 КонецЦикла;
	 
	 НаборЗаписей.Записать();
	 
КонецПроцедуры
